controllers/IndexController.php

SELECT * FROM `post`
---
    public function actionIndex()
    {
        $posts = Post::find()->all();