controllers/ProductController.php

    public function actionIndex()
    {
        $produtos = Product::find()->all();
---
SELECT * FROM `product`

    public function actionView($id)
    {
        $produto = Product::findOne($id);
---
SELECT * FROM `product` WHERE `id`='30'